Repository: yeager/tp-lint
Catalog: locale/*/LC_MESSAGES/tp-lint.po
Languages: de, th

source: Error fetching matrix: {error}
de: Fehler beim Abrufen der Matrix: {error}

source: 📊 Translation Project Statistics
de: 📊 Translation Project Statistiken

source: 📈 Overview
de: 📈 Übersicht

source: Languages: {count}
de: Sprachen: {count}

source: Domains (packages): {count}
de: Domains (Pakete): {count}

source: Total translations: {count}
de: Übersetzungen gesamt: {count}

source: Overall coverage: {pct:.1f}%
de: Gesamtabdeckung: {pct:.1f}%

source: ⚠️ Language '{lang}' not found in matrix
de: ⚠️ Sprache "{lang}" nicht in Matrix gefunden

source: Available: {langs}
de: Verfügbar: {langs}

source: 🔍 Statistics for: {lang}
de: 🔍 Statistik für: {lang}

source: Overall coverage: {pct}%
de: Gesamtabdeckung: {pct}%

source: Translated: {count}/{total} packages
de: Übersetzt: {count}/{total} Pakete

source: ✅ Best translations (100%):
de: ✅ Beste Übersetzungen (100%):

source: ... and {more} more
de: ... und {more} weitere

source: (none)
de: (keine)

source: 🔶 Partial translations:
de: 🔶 Teilweise übersetzt:

source: ❌ Missing (not translated):
de: ❌ Fehlend (nicht übersetzt):

source: (none - all packages translated!)
de: (keine – alle Pakete sind übersetzt!)

source: ⚠️ Domain '{domain}' not found. Did you mean:
de: ⚠️ Domain "{domain}" nicht gefunden. Meinten Sie:

source: ⚠️ Domain '{domain}' not found
de: ⚠️ Domain "{domain}" nicht gefunden

source: 🔍 Statistics for package: {domain}
de: 🔍 Statistik für Paket: {domain}

source: Translations: {count}/{total} languages
de: Übersetzungen: {count}/{total} Sprachen

source: ✅ Complete (100%): {count}
de: ✅ Vollständig (100%): {count}

source: 🔶 Partial: {count}
de: 🔶 Teilweise: {count}

source: ❌ Missing: {count}
de: ❌ Fehlend: {count}

source: 🏆 Top {n} Languages (by coverage)
de: 🏆 Top {n} Sprachen (nach Abdeckung)

source: 📉 Bottom {n} Languages
de: 📉 Letzte {n} Sprachen

source: 📦 Best Covered Packages (most translations)
de: 📦 Bestabgedeckte Pakete (meiste Übersetzungen)

source: 🆘 Least Covered Packages (need translations)
de: 🆘 Am wenigsten abgedeckte Pakete (brauchen Übersetzungen)

source: Error fetching team index: {error}
de: Fehler beim Abrufen des Teamindex: {error}
th: เกิดข้อผิดพลาดในการดึงดัชนีทีม: {error}

source: Language '{lang}' not found on Translation Project
de: Sprache "{lang}" nicht auf Translation Project gefunden
th: ไม่พบภาษา '{lang}' ใน Translation Project

source: Error fetching team page: {error}
de: Fehler beim Abrufen der Teamseite: {error}
th: เกิดข้อผิดพลาดในการดึงหน้าทีม: {error}

source: Error downloading {url}: {error}
de: Fehler beim Herunterladen von {url}: {error}
th: เกิดข้อผิดพลาดในการดาวน์โหลด {url}: {error}

source: Error: l10n-lint not found. Please install l10n-lint first.
de: Fehler: l10n-lint nicht gefunden. Bitte installieren Sie zuerst l10n-lint.
th: ข้อผิดพลาด: ไม่พบ l10n-lint กรุณาติดตั้ง l10n-lint ก่อน

source: Lint PO files from the Translation Project (translationproject.org)
de: PO-Dateien vom Translation Project überprüfen (translationproject.org)
th: ตรวจสอบไฟล์ PO จาก Translation Project (translationproject.org)

source: Language code to lint (e.g., sv, de, fr)
de: Sprachcode zur Überprüfung (z.B. sv, de, fr)
th: รหัสภาษาที่จะตรวจสอบ (เช่น sv, de, fr)

source: List all available languages
de: Alle verfügbaren Sprachen auflisten
th: แสดงรายการภาษาทั้งหมดที่มี

source: Show statistics (optionally for a specific language)
de: Statistiken anzeigen (optional für eine bestimmte Sprache)

source: Show statistics for a specific package/domain
de: Statistiken für ein bestimmtes Paket/Domain anzeigen

source: Number of items in top lists (default: 15)
de: Anzahl der Einträge in Toplisten (Standard: 15)

source: Output format (default: text)
de: Ausgabeformat (Standard: text)
th: รูปแบบผลลัพธ์ (ค่าเริ่มต้น: text)

source: Treat warnings as errors
de: Warnungen als Fehler behandeln
th: ถือว่าคำเตือนเป็นข้อผิดพลาด

source: Keep downloaded PO files (don't delete temp directory)
de: Heruntergeladene PO-Dateien behalten (temp-Verzeichnis nicht löschen)
th: เก็บไฟล์ PO ที่ดาวน์โหลด (ไม่ลบไดเรกทอรีชั่วคราว)

source: Output directory for downloaded PO files (implies --keep)
de: Ausgabeverzeichnis für heruntergeladene PO-Dateien (impliziert --keep)
th: ไดเรกทอรีผลลัพธ์สำหรับไฟล์ PO ที่ดาวน์โหลด (หมายถึง --keep)

source: Only lint specific package(s) (can be repeated)
de: Nur bestimmte Pakete überprüfen (kann wiederholt werden)
th: ตรวจสอบเฉพาะแพ็คเกจที่ระบุ (สามารถระบุซ้ำได้)

source: Group results by translator
de: Ergebnisse nach Übersetzer gruppieren
th: จัดกลุ่มผลลัพธ์ตามนักแปล

source: Fetching languages from Translation Project...
de: Sprachen vom Translation Project abrufen...
th: กำลังดึงรายการภาษาจาก Translation Project...

source: Could not fetch language list
de: Sprachliste konnte nicht abgerufen werden
th: ไม่สามารถดึงรายการภาษาได้

source: Available languages ({count}):
de: Verfügbare Sprachen ({count}):
th: ภาษาที่มี ({count}):

source: Fetching translation matrix...
de: Übersetzungsmatrix abrufen...

source: Fetching PO files for '{lang}'...
de: PO-Dateien für "{lang}" abrufen...
th: กำลังดึงไฟล์ PO สำหรับ '{lang}'...

source: No PO files found for language '{lang}'
de: Keine PO-Dateien für Sprache "{lang}" gefunden
th: ไม่พบไฟล์ PO สำหรับภาษา '{lang}'

source: No matching packages found
de: Keine passenden Pakete gefunden
th: ไม่พบแพ็คเกจที่ตรงกัน

source: Found {count} PO files
de: {count} PO-Dateien gefunden
th: พบ {count} ไฟล์ PO

source: Downloading PO files...
de: PO-Dateien herunterladen...
th: กำลังดาวน์โหลดไฟล์ PO...

source: Downloaded {count} files
de: {count} Dateien heruntergeladen
th: ดาวน์โหลด {count} ไฟล์แล้ว

source: Running l10n-lint...
de: l10n-lint ausführen...
th: กำลังรัน l10n-lint...

source: Unknown
de: Unbekannt
th: ไม่ทราบ

source: Results by translator:
de: Ergebnisse nach Übersetzer:
th: ผลลัพธ์ตามนักแปล:

source: Files: {count}
de: Dateien: {count}
th: ไฟล์: {count}

source: Errors: {count}
de: Fehler: {count}
th: ข้อผิดพลาด: {count}

source: Warnings: {count}
de: Warnungen: {count}
th: คำเตือน: {count}

source: Total: {files} files, {errors} errors, {fuzzy} fuzzy, {warnings} warnings
de: Gesamt: {files} Dateien, {errors} Fehler, {fuzzy} Fuzzy, {warnings} Warnungen

source: PO files saved to: {path}
de: PO-Dateien gespeichert unter: {path}
th: ไฟล์ PO ถูกบันทึกไว้ที่: {path}

source: Example: tp-lint sv
th: ตัวอย่าง: tp-lint sv

source: No files to lint
th: ไม่มีไฟล์ที่จะตรวจสอบ
