Repository: yeager/tp-lint
Catalog: po/man/*.po
Languages: sv

source: February 2026
sv: Februari 2026

source: User Commands
sv: Användarkommandon

source: NAME
sv: NAMN

source: tp-lint - lint translations from the Translation Project (TP)
sv: tp-lint – linta översättningar från Translation Project (TP)

source: B<tp-lint> [I<LANGUAGE>] [I<OPTIONS>]
sv: B<tp-lint> [I<SPRÅK>] [I<FLAGGOR>]

source: DESCRIPTION
sv: BESKRIVNING

source: B<tp-lint> downloads and lints PO files from the GNU Translation Project (translationproject.org). It fetches translation files for a given language, runs l10n-lint quality checks, and provides statistics and reports.
sv: B-<tp-lint> hämtar ner och lintar PO-filer från GNU Translation Project (translationproject.org). Det hämtar översättningsfiler för ett angivet språk, kör kvalitetskontroller med l10n-lint och tillhandahåller statistik och rapporter.

source: The tool downloads PO files to a temporary directory (or a specified output directory), then analyzes them using l10n-lint's checking engine. Results can be grouped by package or by translator.
sv: Verktyget hämtar ner PO-filer till en tillfällig katalog (eller en angiven utdatakatalog) och analyserar dem sedan med hjälp av l10n-lints kontrollmotor. Resultaten kan grupperas efter paket eller översättare.

source: Exit codes: 0 = no errors, 1 = errors found, 2 = usage error.
sv: Avslutningskoder: 0 = inga fel, 1 = fel upptäckta, 2 = användningsfel.

source: POSITIONAL ARGUMENTS
sv: POSITIONELLA ARGUMENT

source: I<LANGUAGE>
sv: I<SPRÅK>

source: Language code to lint (e.g., B<sv>, B<de>, B<fr>). If omitted, some options like B<--list> and B<--stats> work without it.
sv: Språkkod att linta (t.ex. B<sv>, B<de>, B<fr>). Om den utelämnas fungerar vissa flaggor som B<--list> och B<--stats> utan den.

source: OPTIONS
sv: FLAGGOR

source: List all available languages on the Translation Project. Displays language codes and names.
sv: Lista alla tillgängliga språk i översättningsprojektet. Visar språkkoder och namn.

source: B<-s>, B<--stats> [I<LANG>]
sv: B<-s>, B<--stats> [I<SPRÅK>]

source: Show translation statistics. Without a language argument, shows global statistics across all languages. With a language code, shows detailed statistics for that language including number of translated packages, completion percentages, and top translators.
sv: Visa översättningsstatistik. Utan ett språkargument visas global statistik för alla språk. Med en språkkod visas detaljerad statistik för det språket, inklusive antal översatta paket, färdigställandegrad och de bästa översättarna.

source: B<-d>, B<--domain> I<PACKAGE>
sv: B<-d>, B<--domain> I<PAKET>

source: Show statistics for a specific package/domain across all languages. Example: B<--domain coreutils> shows translation status for GNU coreutils in all languages.
sv: Visa statistik för ett specifikt paket/domän för alla språk. Exempel: B<--domain coreutils> visar översättningsstatus för GNU coreutils på alla språk.

source: Number of items to show in top lists (most translated packages, top translators, etc.). Default: 15.
sv: Antal objekt som ska visas i topplistor (mest översatta paket, bästa översättare osv.). Standard: 15.

source: B<-r>, B<--report> [I<LANG>]
sv: B<-r>, B<--report> [I<SPRÅK>]

source: Generate a detailed report. Without a language argument, generates a global report. With a language code, generates a language-specific report with per-package quality scores.
sv: Generera en detaljerad rapport. Utan ett språkargument genereras en global rapport. Med en språkkod genereras en språkspecifik rapport med kvalitetspoäng per paket.

source: Report output format. Choices: B<markdown> (default), B<html>.
sv: Utdataformat för rapport. Alternativ: B<markdown> (standard), B<html>.

source: B<--report-output> I<FILE>
sv: B<--report-output> I<FIL>

source: Save report to a file instead of printing to stdout.
sv: Spara rapporten i en fil istället för att skriva ut den till stdout.

source: Output results as JSON. Shorthand for B<--format json>.
sv: Skriv ut resultaten som JSON. Förkortning för B<--format json>.

source: Suppress non-essential output. Only errors are shown.
sv: Undvik onödig utdata. Endast fel visas.

source: Output format. Choices: B<text> (default, human-readable), B<json> (structured output), B<github> (GitHub Actions annotations).
sv: Utdataformat. Alternativ: B<text> (standard, läsbart för människor), B<json> (strukturerad utdata), B<github> (GitHub Actions-anteckningar).

source: Treat warnings as errors. Useful for CI pipelines.
sv: Behandla varningar som fel. Användbart för CI-pipelines.

source: Keep downloaded PO files after linting. By default, the temporary directory is deleted when done.
sv: Behåll hämtade PO-filer efter lintning. Som standard raderas den tillfälliga katalogen när processen är klar.

source: B<-o>, B<--output> I<DIR>
sv: B<-o>, B<--output> I<KAT>

source: Output directory for downloaded PO files. Implies B<--keep>. Useful for archiving or further manual review.
sv: Utdatakatalog för hämtade PO-filer. Medför B-<--keep>. Användbart för arkivering eller ytterligare manuell granskning.

source: B<-p>, B<--package> I<PACKAGE>
sv: B<-p>, B<--package> I<PAKET>

source: Only lint specific package(s). Can be specified multiple times: B<-p coreutils -p bash>. Other packages are skipped.
sv: Endast linta specifika paket. Kan anges flera gånger: B<-p coreutils -p bash>. Övriga paket hoppas över.

source: Download PO files only, do not run lint checks. Useful with B<-o> to just fetch files for manual review.
sv: Hämta endast ner PO-filer, kör inte lint-kontroller. Användbart med B-<-o> för att bara hämta filer för manuell granskning.

source: Group lint results by translator (from the PO file Last-Translator header) instead of by package. Useful for identifying translators who may need guidance.
sv: Gruppera lint-resultat efter översättare (från PO-filens Last-Translator-rubrik) istället för efter paket. Användbart för att identifiera översättare som kan behöva vägledning.

source: Show detailed progress including each file being downloaded and checked.
sv: Visa detaljerat förlopp inklusive varje fil som hämtas ner och kontrolleras.

source: Show help message and exit.
sv: Visa hjälpinformation och avsluta.

source: Show version number and exit.
sv: Visa versionsnummer och avsluta.

source: EXIT STATUS
sv: AVSLUTSSTATUS

source: No lint errors found.
sv: Inga lint-fel hittades.

source: Lint errors found (or warnings with B<--strict>).
sv: Lint-fel hittades (eller varningar med B-<--strict>).

source: Usage error or download failure.
sv: Användningsfel eller hämtningsfel.

source: EXAMPLES
sv: EXEMPEL

source: Lint all Swedish translations from the Translation Project:
sv: Linta alla svenska översättningar från Translation Project:

source: List all available languages:
sv: Lista alla tillgängliga språk:

source: Show Swedish translation statistics:
sv: Visa svensk översättningsstatistik:

source: Lint only coreutils and bash, keep the files:
sv: Linta endast coreutils och bash, behåll filerna:

source: Generate an HTML report:
sv: Generera en HTML-rapport:

source: Group results by translator:
sv: Gruppera resultat per översättare:

source: Download files without linting:
sv: Hämta ner filer utan lintning:

source: SEE ALSO
sv: SE ÄVEN

source: AUTHOR
sv: UPPHOVSPERSON

source: BUGS
sv: BUGGAR

source: Report bugs at: https://github.com/yeager/tp-lint/issues
sv: Rapportera buggar på: https://github.com/yeager/tp-lint/issues

source: COPYRIGHT
sv: UPPHOVSRÄTT

source: Copyright \(co 2026 Daniel Nylander. License: GPL-3.0-or-later.
sv: Copyright \(co 2026 Daniel Nylander. Licens: GPL-3.0-eller-senare.
