Repository: yeager/tp-lint
Catalog: po/*.po
Languages: sv

source: Error fetching matrix: {error}
sv: Fel vid hämtning av matris: {error}

source: 📊 Translation Project Statistics
sv: 📊 Statistik för Translation Project

source: 📈 Overview
sv: 📈 Översikt

source: Languages: {count}
sv: Språk: {count}

source: Domains (packages): {count}
sv: Domäner (paket): {count}

source: Total translations: {count}
sv: Totalt antal översättningar: {count}

source: Overall coverage: {pct:.1f}%
sv: Total täckning: {pct:.1f}%

source: ⚠️ Language '{lang}' not found in matrix
sv: ⚠️ Språket '{lang}' hittades inte i matrisen

source: Available: {langs}
sv: Tillgängliga: {langs}

source: 🔍 Statistics for: {lang}
sv: 🔍 Statistik för: {lang}

source: Overall coverage: {pct}%
sv: Total täckning: {pct}%

source: Translated: {count}/{total} packages
sv: Översatta: {count}/{total} paket

source: ✅ Best translations (100%):
sv: ✅ Bästa översättningar (100%):

source: ... and {more} more
sv: ... och {more} till

source: (none)
sv: (ingen)

source: 🔶 Partial translations:
sv: 🔶 Delvisa översättningar:

source: ❌ Missing (not translated):
sv: ❌ Saknas (inte översatta):

source: (none - all packages translated!)
sv: (inga - alla paket översatta!)

source: ⚠️ Domain '{domain}' not found. Did you mean:
sv: ⚠️ Domänen '{domain}' hittades inte. Menade du:

source: ⚠️ Domain '{domain}' not found
sv: ⚠️ Domänen '{domain}' hittades inte

source: 🔍 Statistics for package: {domain}
sv: 🔍 Statistik för paket: {domain}

source: Translations: {count}/{total} languages
sv: Översättningar: {count}/{total} språk

source: ✅ Complete (100%): {count}
sv: ✅ Kompletta (100%): {count}

source: 🔶 Partial: {count}
sv: 🔶 Delvisa: {count}

source: ❌ Missing: {count}
sv: ❌ Saknas: {count}

source: 🏆 Top {n} Languages (by coverage)
sv: 🏆 Topp {n} språk (efter täckning)

source: 📉 Bottom {n} Languages
sv: 📉 Sämsta {n} språk

source: 📦 Best Covered Packages (most translations)
sv: 📦 Bäst täckta paket (flest översättningar)

source: 🆘 Least Covered Packages (need translations)
sv: 🆘 Minst täckta paket (behöver översättning)

source: Report saved to: {path}
sv: Rapport sparad till: {path}

source: Error fetching team index: {error}
sv: Fel vid hämtning av teamindex: {error}

source: Language '{lang}' not found on Translation Project
sv: Språket '{lang}' hittades inte i Translation Project

source: Error fetching team page: {error}
sv: Fel vid hämtning av teamsidan: {error}

source: Error downloading {url}: {error}
sv: Fel vid hämtning av {url}: {error}

source: Error: l10n-lint not found. Please install l10n-lint first.
sv: Fel: l10n-lint hittades inte. Installera först l10n-lint.

source: positional arguments
sv: positionsargument

source: options
sv: flaggor

source: ⚠️ Warning: l10n-lint not found. Install it for linting functionality:
sv: ⚠️ Varning: l10n-lint hittades inte. Installera det för lintingfunktionalitet:

source: Lint PO files from the Translation Project (translationproject.org)
sv: Linta PO-filer från Translation Project (translationproject.org)

source: Examples: tp-lint -l List all available languages tp-lint -s Show global translation statistics tp-lint -s sv Show statistics for Swedish tp-lint sv Lint all Swedish PO files tp-lint -d coreutils sv Lint only coreutils for Swedish tp-lint --no-lint sv Download only, don't lint tp-lint -r sv --report-format html --report-output sv.html Generate HTML report for Swedish
sv: Exempel: tp-lint -l Lista alla tillgängliga språk tp-lint -s Visa global översättningsstatistik tp-lint -s sv Visa statistik för svenska tp-lint sv Linta alla svenska PO-filer tp-lint -d coreutils sv Linta endast coreutils för svenska tp-lint --no-lint sv Endast hämtning, ingen lint tp-lint -r sv --report-format html --report-output sv.html Generera HTML-rapport för svenska

source: Language code to lint (e.g., sv, de, fr)
sv: Språkkod att linta (t.ex. sv, de, fr)

source: List all available languages
sv: Lista alla tillgängliga språk

source: Show statistics (optionally for a specific language)
sv: Visa statistik (valfritt för ett specifikt språk)

source: Show statistics for a specific package/domain
sv: Visa statistik för ett specifikt paket/domän

source: Number of items in top lists (default: 15)
sv: Antal objekt i topplistor (standard: 15)

source: Generate report (optionally for a specific language)
sv: Generera rapport (valfritt för ett specifikt språk)

source: Report format (default: markdown)
sv: Rapportformat (standard: markdown)

source: Save report to file
sv: Spara rapporten i en fil

source: JSON output (shorthand for --format json)
sv: JSON-utdata (förkortning för --format json)

source: Suppress non-essential output (only errors)
sv: Undertryck icke-väsentlig utdata (endast fel)

source: Output format (default: text)
sv: Utdataformat (standard: text)

source: Treat warnings as errors
sv: Behandla varningar som fel

source: Keep downloaded PO files (don't delete temp directory)
sv: Behåll hämtade PO-filer (ta inte bort temporärkatalogen)

source: Output directory for downloaded PO files (implies --keep)
sv: Utdatakatalog för hämtade PO-filer (medför --keep)

source: Only lint specific package(s) (can be repeated)
sv: Linta endast specifika paket (kan upprepas)

source: Download only, don't run l10n-lint
sv: Endast hämtning, kör inte l10n-lint

source: Group results by translator
sv: Gruppera resultat efter översättare

source: Show detailed progress
sv: Visa detaljerat förlopp

source: Show this help message and exit
sv: Visa detta hjälpmeddelande och avsluta

source: Show version number and exit
sv: Visa versionsnummer och avsluta

source: ⏱️ Total elapsed time: {elapsed:.2f}s
sv: ⏱️ Total förfluten tid: {elapsed:.2f}s

source: 🔧 tp-lint {version} starting...
sv: 🔧 tp-lint {version} startar...

source: Mode: List languages
sv: Läge: Lista språk

source: Fetching languages from Translation Project...
sv: Hämtar språk från Translation Project...

source: Could not fetch language list
sv: Kunde inte hämta språklistan

source: Available languages ({count}):
sv: Tillgängliga språk ({count}):

source: Mode: Generate report
sv: Läge: Generera rapport

source: Output file: {file}
sv: Utdatafil: {file}

source: Fetching translation matrix...
sv: Hämtar översättningsmatris...

source: Connecting to translationproject.org/extra/matrix.html...
sv: Ansluter till translationproject.org/extra/matrix.html...

source: Matrix loaded: {langs} languages, {domains} domains
sv: Matris inläst: {langs} språk, {domains} domäner

source: Mode: Statistics
sv: Läge: Statistik

source: Domain filter: {domain}
sv: Domänfilter: {domain}

source: Mode: Lint language '{lang}'
sv: Läge: Lintar språket '{lang}'

source: Output format: {fmt}
sv: Utdataformat: {fmt}

source: Strict mode: {strict}
sv: Strikt läge: {strict}

source: Domain filter (via -d): {domain}
sv: Domänfilter (via -d): {domain}

source: Package filter: {pkgs}
sv: Paketfilter: {pkgs}

source: Fetching PO files for '{lang}'...
sv: Hämtar PO-filer för '{lang}'...

source: Connecting to translationproject.org...
sv: Ansluter till translationproject.org...

source: Found {count} translators assigned
sv: Hittade {count} tilldelade översättare

source: No PO files found for language '{lang}'
sv: Inga PO-filer hittades för språket '{lang}'

source: No matching packages found
sv: Inga matchande paket hittades

source: Found {count} PO files
sv: Hittade {count} PO-filer

source: Downloading PO files...
sv: Hämtar PO-filer...

source: Output directory: {dir}
sv: Utdatakatalog: {dir}

source: Size: {size} bytes, {elapsed:.2f}s ({speed:.1f} KB/s)
sv: Storlek: {size} byte, {elapsed:.2f}s ({speed:.1f} KB/s)

source: Downloaded {count} files
sv: Hämtade {count} filer

source: Total downloaded: {size:.1f} KB in {elapsed:.2f}s
sv: Totalt hämtat: {size:.1f} KB på {elapsed:.2f}s

source: Average speed: {speed:.1f} KB/s
sv: Genomsnittlig hastighet: {speed:.1f} KB/s

source: No files downloaded
sv: Inga filer har hämtats ner

source: ❌ Error: l10n-lint not found. Install it first:
sv: ❌ Fel: l10n-lint hittades inte. Installera det först:

source: Running l10n-lint...
sv: Kör l10n-lint...

source: By translator: {by_translator}
sv: Efter översättare: {by_translator}

source: Files to lint: {count}
sv: Filer att linta: {count}

source: Unknown
sv: Okänd

source: Results by translator:
sv: Resultat efter översättare:

source: Files: {count}
sv: Filer: {count}

source: Errors: {count}
sv: Fel: {count}

source: Fuzzy: {count}
sv: Luddiga: {count}

source: Warnings: {count}
sv: Varningar: {count}

source: Total: {files} files, {errors} errors, {fuzzy} fuzzy, {warnings} warnings
sv: Totalt: {files} filer, {errors} fel, {fuzzy} luddiga, {warnings} varningar

source: ✅ Downloaded {count} files to {path}
sv: ✅ Hämtade {count} filer till {path}

source: Run with --lint to check for issues
sv: Kör med --lint för att kontrollera om det finns några problem

source: PO files saved to: {path}
sv: PO-filer sparade till: {path}
